Catalogs/МатрицаАппаратов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.6">
	<Catalog>
		<Properties>
			<Name>МатрицаАппаратов</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.Партнеры</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Артикул</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Цена</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СсылкаНаМодель</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СсылкаНаГрафикМоделиЯМ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>IDЯМ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Модель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЗначенияСвойствОбъектов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Бренд</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЗначенияСвойствОбъектов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипАппарата</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЗначенияСвойствОбъектов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаАктуальности</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

InformationRegisters/дпСоответствиеМатриц.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.6">
	<InformationRegister>
		<Properties>
			<Name>дпСоответствиеМатриц</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>АппаратОрганизации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.МатрицаАппаратов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>АппаратКлиента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.МатрицаАппаратов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Catalogs/Партнеры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.6">
	<Catalog>
		<Properties>
			<Name>Партнеры</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyOfItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>БизнесРегион</Name>
					<Comment>Используется для группировки по территориальному признаку</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.БизнесРегионы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГруппаДоступа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГруппыДоступаПартнеров</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаРегистрации</Name>
					<Comment>Используется при анализе первичного интереса</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Клиент</Name>
					<Comment>Клиенты</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Поставщик</Name>
					<Comment>Поставщики</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеПолное</Name>
					<Comment>Публичное наименование, например, для печати или устного обращения.</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсновнойМенеджер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Конкурент</Name>
					<Comment>Конкуренты</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПрочиеОтношения</Name>
					<Comment>Прочие отношения</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбслуживаетсяТорговымиПредставителями</Name>
					<Comment>Обслуживаются торговыми представителями</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДополнительнаяИнформация</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Перевозчик</Name>
					<Comment>Перевозчики</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ШаблонЭтикетки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ШаблоныЭтикетокИЦенников</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЮрФизЛицо</Name>
					<Type>
						<v8:Type>cfg:EnumRef.КомпанияЧастноеЛицо</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пол</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПолФизическогоЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаРождения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РеквизитАртикула</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПарольМП</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РелизМП</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НазначениеПереработчика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Назначения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВариантОтправкиЭлектронногоЧека</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВариантыОтправкиЭлектронногоЧекаПокупателю</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>КонтактнаяИнформация</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Тип</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ТипыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Вид</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Представление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>500</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначенияПолей</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Страна</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Регион</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Город</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АдресЭП</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДоменноеИмяСервера</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефона</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефонаБезКодов</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидДляСписка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/МатрицаАппаратов/Forms/ФормаЗагрузкиИзВнешнегоФайла/Ext/Form/Module.bsl
&НаКлиенте
Процедура ЗакрытьКоманда(Команда)
	
	ЭтаФорма.Закрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура Далее(Команда)
	
	Если Элементы.Шаг1.Видимость Тогда
		Если ПроверитьЗаполнение() Тогда
			Элементы.Шаг1.Видимость = Ложь;
			Элементы.Шаг2.Видимость = Истина;		
		КонецЕсли;
	ИначеЕсли Элементы.Шаг2.Видимость Тогда
		Элементы.Шаг2.Видимость = Ложь;
		Элементы.Шаг3.Видимость = Истина;
		ОбновитьСоответствие();
	Иначе
		ОбновитьДанные();
		ПоказатьОповещениеПользователя("Загрузка данных", , "Загрузка данных завершена успешно.", БиблиотекаКартинок.ЗагрузкаИзВнешнегоИсточника);
		ЭтаФорма.Закрыть();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ДляБренда = ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоНаименованию("Для бренда");
	НовыйПараметр = Новый ПараметрВыбора("Отбор.Владелец", ДляБренда);
	НовыйМассив = Новый Массив();
	НовыйМассив.Добавить(НовыйПараметр);
	Элементы.СоответствиеБренд.ПараметрыВыбора = Новый ФиксированныйМассив(НовыйМассив);
	
	ДляАппарата = ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоНаименованию("Для аппарата");	
	НовыйПараметр = Новый ПараметрВыбора("Отбор.Владелец", ДляАппарата);
	НовыйМассив = Новый Массив();
	НовыйМассив.Добавить(НовыйПараметр);
	Элементы.СоответствиеТипАппарата.ПараметрыВыбора = Новый ФиксированныйМассив(НовыйМассив);
	
	ДляМоделиУстроиства = ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоНаименованию("Для модели устройства");
	НовыйПараметр = Новый ПараметрВыбора("Отбор.Владелец", ДляМоделиУстроиства);
	НовыйМассив = Новый Массив();
	НовыйМассив.Добавить(НовыйПараметр);
	Элементы.СоответствиеМодель.ПараметрыВыбора = Новый ФиксированныйМассив(НовыйМассив);
	
	ОбновлятьДанные = Истина;
	
	Номер = 1;
	
	Для Каждого Колонка Из ПолучитьКолонки() Цикл
		
		Шапка = ТабличныйДокумент.Область(1, Номер, 1, Номер);
		Шапка.Текст = Колонка.Представление;
		Шапка.ЦветФона = Новый Цвет(245, 242, 221);
		Шапка.Шрифт = Новый Шрифт(Шапка.Шрифт,,10);
		Шапка.РазмещениеТекста = ТипРазмещенияТекстаТабличногоДокумента.Обрезать;
		
		Область = ТабличныйДокумент.Область("C"+Номер);
		Область.ШиринаКолонки = 20;
		Область.ГраницаСверху = Новый Линия(ТипЛинииЯчейкиТабличногоДокумента.Сплошная);
		Область.ГраницаСлева = Новый Линия(ТипЛинииЯчейкиТабличногоДокумента.Сплошная);
		Область.ГраницаСправа = Новый Линия(ТипЛинииЯчейкиТабличногоДокумента.Сплошная);
		Область.ГраницаСнизу = Новый Линия(ТипЛинииЯчейкиТабличногоДокумента.Сплошная);
		Область.ЦветРамки = Новый Цвет(204, 192, 133);
		
		Номер = Номер + 1;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьКолонки()
	
	Колонки = Новый СписокЗначений();
	Колонки.Добавить("Наименование", "Наименование");
	
	Для Каждого Реквизит Из Метаданные.Справочники.МатрицаАппаратов.Реквизиты Цикл
		Колонки.Добавить(Реквизит.Имя, Реквизит.Синоним);
	КонецЦикла;
	
	Возврат Колонки;
	
КонецФункции

&НаСервере
Процедура ОбновитьСоответствие()
	
	ДляБренда = ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоНаименованию("Для бренда");
	ДляАппарата = ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоНаименованию("Для аппарата");	
	ДляМоделиУстроиства = ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоНаименованию("Для модели устройства");
	
	Соответствие.Очистить();
	
	Колонки = ПолучитьКолонки();
	
	Для Номер = 2 По ТабличныйДокумент.ВысотаТаблицы Цикл
		
		НоваяСтрока = Соответствие.Добавить();
		
		Для Номер2 = 0 По Колонки.Количество()-1 Цикл
			
			Значение = ТабличныйДокумент.Область(Номер, Номер2+1).Текст;
			
			Если Колонки[Номер2].Значение = "Дата" Тогда
				НоваяСтрока[Колонки[Номер2].Значение] = ПолучитьДатуИзСтроки(Значение);
			ИначеЕсли Колонки[Номер2].Значение = "Бренд" Тогда
				НоваяСтрока[Колонки[Номер2].Значение] = Справочники.ЗначенияСвойствОбъектов.НайтиПоНаименованию(Значение, Истина, , ДляБренда);
			ИначеЕсли Колонки[Номер2].Значение = "Модель" Тогда
				НоваяСтрока[Колонки[Номер2].Значение] = Справочники.ЗначенияСвойствОбъектов.НайтиПоНаименованию(Значение, Истина, , ДляМоделиУстроиства);
			ИначеЕсли Колонки[Номер2].Значение = "ТипАппарата" Тогда
				НоваяСтрока[Колонки[Номер2].Значение] = Справочники.ЗначенияСвойствОбъектов.НайтиПоНаименованию(Значение, Истина, , ДляАппарата);
			Иначе
				НоваяСтрока[Колонки[Номер2].Значение] = Значение;
			КонецЕсли;
						
		КонецЦикла;
		
		НоваяСтрока.Ссылка = ПолучитьСоответствие(НоваяСтрока.Наименование);
		
	КонецЦикла;
	
	
КонецПроцедуры

&НаСервере
Функция ПолучитьДатуИзСтроки(Стр) 

         Д = Дата("00010101000000");

         Если ПустаяСтрока(Стр) Тогда
             Возврат Д;
         КонецЕсли;

         Если Найти(Стр,".") > 0 Тогда

             Если Найти(Стр,":") > 0 И Найти(Стр," ") > 0 Тогда 
                 М = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(Стр," ");
                 Возврат ПолучитьДатуИзСтроки(М[0]);
             КонецЕсли;

             М = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(Стр,".");

         ИначеЕсли Найти(Стр,"/")>0 Тогда

             М = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(Стр,"/");

         ИначеЕсли Найти(Стр,",")>0 Тогда

             М = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(Стр,",");

         ИначеЕсли Найти(Стр,"-")>0 Тогда

             М = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(Стр,"-");

         КонецЕсли; 

         Попытка

             Если М.Количество() = 3 Тогда //"01.02.13" или "01.02.2013"
                 Год = ?(СтрДлина(М[2]) = 2,2000 + М[2],М[2]);
                 Д = Дата(Год,М[1],М[0]);
             ИначеЕсли М.Количество() = 2 Тогда //"02.13" или "02.2013";
                 Год = ?(СтрДлина(М[1]) = 2,2000 + М[1],М[1]);
                 Д = Дата(Год,М[0],1);
             КонецЕсли;

         Исключение
         КонецПопытки; 

         Возврат Д; 

     КонецФункции

&НаСервере
Функция ПолучитьСоответствие(Наименование)
	
	Возврат Справочники.МатрицаАппаратов.НайтиПоНаименованию(Наименование, , , Владелец);
	
КонецФункции

&НаСервере
Процедура ОбновитьДанные()
	
	Для Каждого Строка Из Соответствие Цикл

		Объект = Неопределено;
		
		Если Строка.Ссылка.Пустая() Тогда
			Объект = Справочники.МатрицаАппаратов.СоздатьЭлемент();
		ИначеЕсли ОбновлятьДанные Тогда
			Объект = Строка.Ссылка.ПолучитьОбъект();
		КонецЕсли;
		
		Если Объект <> Неопределено Тогда
			
			Для Каждого Колонка Из ПолучитьКолонки() Цикл
				Если Строка(Строка[Колонка.Значение]) <> "" И Строка[Колонка.Значение] <> 0 И Строка[Колонка.Значение] <> Дата(1,1,1) Тогда
					Объект[Колонка.Значение] = Строка[Колонка.Значение];
				КонецЕсли;
			КонецЦикла;
			
			Объект.Владелец = Владелец;
			
			Объект.Записать();
			
		КонецЕсли;
		
	КонецЦикла;
	
	//Кожемякин А.Г. agkozhemyakin@gmail.com {
	//12.04.2016 10:14:02
	УстановитьСоотвествиеМатриц();		
	//}Кожемякин А.Г.	
	
КонецПроцедуры

&НаСервере
Процедура УстановитьСоотвествиеМатриц()

		//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	МатрицаАппаратов.Ссылка КАК АппаратКлиента
		|ПОМЕСТИТЬ АппаратыБезСоответствия
		|ИЗ
		|	Справочник.МатрицаАппаратов КАК МатрицаАппаратов
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.дпСоответствиеМатриц КАК дпСоответствиеМатриц
		|		ПО (дпСоответствиеМатриц.АппаратКлиента = МатрицаАппаратов.Ссылка)
		|ГДЕ
		|	МатрицаАппаратов.Владелец = &Владелец
		|	И дпСоответствиеМатриц.АппаратОрганизации ЕСТЬ NULL 
		|
		|СГРУППИРОВАТЬ ПО
		|	МатрицаАппаратов.Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	МатрицаАппаратов.Ссылка КАК АппаратОрганизации
		|ПОМЕСТИТЬ АппаратыОрганизации
		|ИЗ
		|	Справочник.МатрицаАппаратов КАК МатрицаАппаратов
		|ГДЕ
		|	МатрицаАппаратов.Владелец = &ВладелецОрганизация
		|
		|СГРУППИРОВАТЬ ПО
		|	МатрицаАппаратов.Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	АппаратыБезСоответствия.АппаратКлиента,
		|	МАКСИМУМ(АппаратыОрганизации.АппаратОрганизации) КАК АппаратОрганизации,
		|	МАКСИМУМ(дпСоответствиеМатриц.АппаратОрганизации) КАК АппаратОрганизации2
		|ИЗ
		|	АппаратыБезСоответствия КАК АппаратыБезСоответствия
		|		ЛЕВОЕ СОЕДИНЕНИЕ АппаратыОрганизации КАК АппаратыОрганизации
		|		ПО АппаратыБезСоответствия.АппаратКлиента.Наименование = АппаратыОрганизации.АппаратОрганизации.Наименование
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.дпСоответствиеМатриц КАК дпСоответствиеМатриц
		|		ПО АппаратыБезСоответствия.АппаратКлиента.Наименование = дпСоответствиеМатриц.АппаратКлиента.Наименование
		|ГДЕ
		|	(АппаратыОрганизации.АппаратОрганизации ЕСТЬ НЕ NULL 
		|			ИЛИ дпСоответствиеМатриц.АппаратОрганизации ЕСТЬ НЕ NULL )
		|
		|СГРУППИРОВАТЬ ПО
		|	АппаратыБезСоответствия.АппаратКлиента";
	
	Запрос.УстановитьПараметр("Владелец", Владелец);
	Запрос.УстановитьПараметр("ВладелецОрганизация", Справочники.Партнеры.НашеПредприятие);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Если ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.АппаратКлиента)
			и (ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.АппаратОрганизации)
			 или ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.АппаратОрганизации2)) Тогда
			
			МенеджерЗаписи = РегистрыСведений.дпСоответствиеМатриц.СоздатьМенеджерЗаписи();
			МенеджерЗаписи.АппаратКлиента 		= ВыборкаДетальныеЗаписи.АппаратКлиента;
			Если ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.АппаратОрганизации) Тогда
				МенеджерЗаписи.АппаратОрганизации 	= ВыборкаДетальныеЗаписи.АппаратОрганизации;
			Иначе
				МенеджерЗаписи.АппаратОрганизации 	= ВыборкаДетальныеЗаписи.АппаратОрганизации2;
			КонецЕсли;	
			МенеджерЗаписи.Записать();
			
			
		КонецЕсли;
	КонецЦикла;
	
	//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если Владелец.Пустая() Тогда
		Результат = ОткрытьФормуМодально("Справочник.Партнеры.Форма.ФормаВыбора", Новый Структура("РежимВыбора", Истина));
		Если Результат <> Неопределено Тогда
			Владелец = Результат;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры
